experiment-finetuned/all_finetuned/runs/obliqueShock/1/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (2.9 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (2.9 0 0);
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform (2.9 0 0);
        value           uniform (2.9 0 0);
    }

    top
    {
        type            fixedValue;
        value           uniform (2.61933 -0.50632 0);
    }

    bottom
    {
        type            symmetryPlane;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //